# STAR SCHEMA

In [17]:
import os
import mysql.connector
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [22]:
connection = mysql.connector.connect(host = 'localhost',
                                    user = 'root',
                                    passwd = '',
                                    db = 'perpustakaan')

In [23]:
connection

In [53]:
tabel_perpustakaan = pd.read_sql_query('SHOW TABLES FROM perpustakaan', connection)
tabel_perpustakaan

  Tables_in_perpustakaan
0              data_buku
1           data_pegawai
2          data_peminjam
3            data_pinjam

In [54]:
tabel_buku = pd.read_sql_query('SELECT * from data_buku', connection)
tabel_buku

   Id_buku                          judul_buku         pengarang  penerbit
0        1   Overlord, Vol. 1: The Undead King   Kugane Maruyama  Gramedia
1        2  Overlord, Vol. 2: The Dark Warrior   Kugane Maruyama  Gramedia
2        3             Detective Conan, Vol. 1      Gosho Aoyama  Gramedia

In [55]:
tabel_pegawai = pd.read_sql_query('SELECT * from data_pegawai', connection)
tabel_pegawai

   id_pegawai nama_pegawai    alamat         no_hp
0           1          Adi  Surabaya  081253846329
1           2          Ali  Surabaya  083736182323
2           3         Dian  Sidoarjo  083273281232

In [56]:
tabel_peminjam = pd.read_sql_query('SELECT * from data_peminjam', connection)
tabel_peminjam

   Id_peminjam nama_peminjam    alamat         no_hp
0            1         Ilham     Krian  081273639234
1            2          Alan  Sidoarjo  083783672812
2            3         Ihsan  Surabaya  083271282343

In [57]:
tabel_pinjam = pd.read_sql_query('SELECT * from data_pinjam', connection)
tabel_pinjam

   Id_pinjam  id_buku  id_pegawai  id_peminjam  tgl_pinjam tgl_kembali
0          1        1           1            1  2021-05-03  2021-05-10
1          2        2           2            2  2021-05-12  2021-05-19
2          3        3           3            3  2021-05-14  2021-05-21

In [66]:
query = '''SELECT Pinjam.Id_pinjam, Buku.judul_buku, Peminjam.nama_peminjam,
            Pegawai.nama_pegawai, Pinjam.tgl_pinjam, Pinjam.tgl_kembali
            from data_pinjam Pinjam
            inner join data_buku Buku
                on (Pinjam.id_buku = Buku.id_buku)
            inner join data_peminjam Peminjam
                on (Pinjam.id_peminjam = Peminjam.id_peminjam)
            inner join data_pegawai Pegawai
                on (Pinjam.id_pegawai = Pegawai.id_pegawai)'''

In [67]:
tabel_pinjam = pd.read_sql_query(query, connection)
tabel_pinjam

,Id_pinjam,judul_buku,nama_peminjam,nama_pegawai,tgl_pinjam,tgl_kembali
0,1,"Overlord, Vol. 1: The Undead King",Ilham,Adi,2021-05-03,2021-05-10
1,2,"Overlord, Vol. 2: The Dark Warrior",Alan,Ali,2021-05-12,2021-05-19
2,3,"Detective Conan, Vol. 1",Ihsan,Dian,2021-05-14,2021-05-21

# SNOWFLAKE SCHEMA

In [68]:
connect = mysql.connector.connect(host = 'localhost',
                                    user = 'root',
                                    passwd = '',
                                    db = 'nilai')

In [69]:
connect

In [72]:
tabel_nilai = pd.read_sql_query('SHOW TABLES FROM nilai', connect)
tabel_nilai

  Tables_in_nilai
0       data_guru
1      data_nilai
2  data_pelajaran
3      data_siswa

In [73]:
tabel_guru = pd.read_sql_query('SELECT * from data_guru', connect)
tabel_guru

   id_guru nama_guru jenis_kelamin    alamat
0        1     Brian             L  Surabaya
1        2      Dian             P  Surabaya

In [74]:
tabel_data_nilai = pd.read_sql_query('SELECT * from data_nilai', connect)
tabel_data_nilai

   id_nilai  id_siswa  id_pelajaran  nilai
0         1         1             1     80
1         2         2             2     90
2         3         3             1     89

In [75]:
tabel_pelajaran = pd.read_sql_query('SELECT * from data_pelajaran', connect)
tabel_pelajaran

   id_pelajaran  id_guru   pelajaran
0             1        1  matematika
1             2        2         ipa

In [76]:
tabel_siswa = pd.read_sql_query('SELECT * from data_siswa', connect)
tabel_siswa

   id_siswa nama_siswa jenis_kelamin    alamat
0         1        Adi             L  Surabaya
1         2       Diah             P  Surabaya
2         3      Ilham             L  Sidoarjo

In [77]:
query_nilai = '''SELECT Nilai.Id_nilai, Siswa.nama_siswa, Pelajaran.pelajaran,
            Guru.nama_guru, Nilai.nilai
            from data_nilai Nilai
            inner join data_siswa Siswa
                on (Nilai.id_nilai = Siswa.id_siswa)
            inner join data_pelajaran Pelajaran
                on (Nilai.id_pelajaran = Pelajaran.id_pelajaran)
            inner join data_guru Guru
                on (Pelajaran.id_guru = Guru.id_guru)'''

In [79]:
tabel_hasil_nilai = pd.read_sql_query(query_nilai, connect)
tabel_hasil_nilai

   Id_nilai nama_siswa   pelajaran nama_guru  nilai
0         1        Adi  matematika     Brian     80
1         3      Ilham  matematika     Brian     89
2         2       Diah         ipa      Dian     90

# GALAXY SCHEMA

In [80]:
con = mysql.connector.connect(host = 'localhost',
                                    user = 'root',
                                    passwd = '',
                                    db = 'penjualan')

In [81]:
con

In [87]:
tabel_penjualan = pd.read_sql_query('SHOW TABLES FROM penjualan', con)
tabel_penjualan

  Tables_in_penjualan
0         data_barang
1        data_pembeli
2        data_penjual
3   data_pesan_online
4      data_transaksi

In [88]:
tabel_barang = pd.read_sql_query('SELECT * from data_barang', con)
tabel_barang

   id_barang nama_barang  stok  harga
0          1    Sunlight   100  10000
1          2       RInso   100  15000

In [89]:
tabel_pembeli = pd.read_sql_query('SELECT * from data_pembeli', con)
tabel_pembeli

   id_pembeli nama_pembeli    alamat         no_hp
0           1          Adi  Surabaya  081043823434
1           2         Fika  Surabaya   08327328321

In [90]:
tabel_penjual = pd.read_sql_query('SELECT * from data_penjual', con)
tabel_penjual

   id_pegawai nama_pegawai    alamat         no_hp
0           1         Lila     Krian  081253846329
1           2         Dian  Sidoarjo  083783672812

In [91]:
tabel_pesan = pd.read_sql_query('SELECT * from data_pesan_online', con)
tabel_pesan

   id_pesan_online  id_pembeli  id_barang
0                1           1          2
1                2           2          1

In [92]:
tabel_transaksi = pd.read_sql_query('SELECT * from data_transaksi', con)
tabel_transaksi

,id_transaksi,id_pesan_online,id_pegawai,id_pembeli,id_barang,stok_dibeli,total_harga
0,1,1,1,1,2,1,10000
1,2,2,2,1,1,1,15000

In [97]:
query_transaksi = '''SELECT Transaksi.Id_transaksi, Pembeli.nama_pembeli, Barang.nama_barang, 
                Transaksi.stok_dibeli, Transaksi.total_harga
            from data_transaksi Transaksi
            inner join data_pesan_online Pesan
                on (Transaksi.id_pesan_online = Pesan.id_pesan_online)
            inner join data_pembeli Pembeli
                on (Pesan.id_pembeli = Pembeli.id_pembeli)
            inner join data_barang Barang
                on (Pesan.id_barang = Barang.id_barang)'''

In [101]:
tabel_hasil_transaksi = pd.read_sql_query(query_transaksi, con)
print("Beli Online")
tabel_hasil_transaksi

Beli Online

   Id_transaksi nama_pembeli nama_barang  stok_dibeli  total_harga
0             1          Adi       RInso            1        10000
1             2         Fika    Sunlight            1        15000

In [102]:
query_transaksi_2 = '''SELECT Transaksi.Id_transaksi, Pegawai.nama_pegawai, Pembeli.nama_pembeli, Barang.nama_barang, 
                Transaksi.stok_dibeli, Transaksi.total_harga
            from data_transaksi Transaksi
            inner join data_penjual Pegawai
                on (Transaksi.id_pegawai = Pegawai.id_pegawai)
            inner join data_pesan_online Pesan
                on (Transaksi.id_pesan_online = Pesan.id_pesan_online)
            inner join data_pembeli Pembeli
                on (Pesan.id_pembeli = Pembeli.id_pembeli)
            inner join data_barang Barang
                on (Pesan.id_barang = Barang.id_barang)'''

In [103]:
tabel_hasil_transaksi_2 = pd.read_sql_query(query_transaksi_2, con)
print("Beli Offline")
tabel_hasil_transaksi_2

Beli Offline

,Id_transaksi,nama_pegawai,nama_pembeli,nama_barang,stok_dibeli,total_harga
0,1,Lila,Adi,RInso,1,10000
1,2,Dian,Fika,Sunlight,1,15000